src/DataProcessors/ОформлениеПустыхКанбановИлиИзлишков/ОформлениеПустыхКанбановИлиИзлишков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОформлениеПустыхКанбановИлиИзлишков</name>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Канбаны</name>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаСкладе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВПроизводстве</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПустыхЯчеек</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЯчеек</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВЯчейке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ошибка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/DataProcessors/ОформлениеПустыхКанбановИлиИзлишков/Forms/Форма/Module.bsl
&НаСервере
Процедура ПолучитьДанныеНаСервере()
Объект.Канбаны.Очистить();
Запрос = Новый Запрос;
 
Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛьготнаяОчередьСрезПоследних.Линейка КАК Линейка,
	|	ЛьготнаяОчередьСрезПоследних.НормаРасходов.Элемент КАК МПЗ
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь.СрезПоследних(&НаДату, ) КАК ЛьготнаяОчередьСрезПоследних
	|ГДЕ
	|	ЛьготнаяОчередьСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	Если СписокЛинеек.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ЛьготнаяОчередьСрезПоследних.Линейка В(&СписокЛинеек)";
	Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
	КонецЕсли;
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО Линейка,МПЗ";
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ТипЗнч(ВыборкаДетальныеЗаписи.МПЗ) = Тип("СправочникСсылка.Номенклатура") Тогда
		ВыбПодразделение = ВыборкаДетальныеЗаписи.МПЗ.Канбан.Подразделение;
		Иначе
		ВыбПодразделение = Константы.МестоХраненияОсновное.Получить().Подразделение;
		КонецЕсли;
			Если Не Объект.Подразделение.Пустая() Тогда
				Если ВыбПодразделение <> Объект.Подразделение Тогда				
				Продолжить;
				КонецЕсли;			
			КонецЕсли;
				Если ВыбПодразделение.ОформлятьПустыеКанбаны <> 1 Тогда
				Продолжить;		
				КонецЕсли;   
	ЯчейкиКомплектации = ОбщийМодульРаботаСРегистрами.ПолучитьЯчейкуКомплектации(ВыборкаДетальныеЗаписи.Линейка,ВыборкаДетальныеЗаписи.МПЗ);
	КоличествоПустыхЯчеек = ЯчейкиКомплектации.КоличествоЯчеек - ОбщийМодульВызовСервера.ПолучитьКоличествоПустыхКанбанов(ВыборкаДетальныеЗаписи.Линейка,ВыборкаДетальныеЗаписи.МПЗ);
		Если КоличествоПустыхЯчеек > 0 Тогда
		ТЧ = Объект.Канбаны.Добавить();
		ТЧ.МестоХранения = ВыборкаДетальныеЗаписи.Линейка.МестоХраненияКанбанов;
		ТЧ.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;	
		ТЧ.Поставщик = ВыбПодразделение;
		ТЧ.КоличествоНаСкладе = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокНаСкладе(ВыборкаДетальныеЗаписи.Линейка,ВыборкаДетальныеЗаписи.МПЗ);
		ТЧ.КоличествоВПроизводстве = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокВПроизводстве(ВыборкаДетальныеЗаписи.Линейка,ВыборкаДетальныеЗаписи.МПЗ);
		ТЧ.КоличествоПустыхЯчеек = КоличествоПустыхЯчеек;
		ТЧ.КоличествоЯчеек = ЯчейкиКомплектации.КоличествоЯчеек;
		ТЧ.КоличествоВЯчейке = ЯчейкиКомплектации.КоличествоВЯчейке;
		КолСклад = ТЧ.КоличествоНаСкладе + ТЧ.КоличествоВПроизводстве;
			Если (КолСклад < ТЧ.КоличествоВЯчейке) или (КолСклад = 0) Тогда
				Если ТЧ.КоличествоПустыхЯчеек = ТЧ.КоличествоЯчеек Тогда
				ТЧ.Ошибка = Истина;
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанные(Команда)
ПолучитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеПоПустымКанбанам()
ПолучитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОформитьИзлишки(Команда)
П = Новый Структура("ВидОперации,МестоХраненияКанбанов,МПЗ",2,Элементы.Канбаны.ТекущиеДанные.МестоХранения,Элементы.Канбаны.ТекущиеДанные.МПЗ);
	Если ОткрытьФормуМодально("ОбщаяФорма.ОформлениеНедостачиИзлишков",П) Тогда
	ПолучитьДанныеНаСервере();
	КонецЕсли;                
КонецПроцедуры

&НаКлиенте
Процедура ОформитьПустойКанбан(Команда)
	Если ОбщийМодульВызовСервера.МожноОформитьПустойКанбан(Элементы.Канбаны.ТекущиеДанные.МПЗ) Тогда
	П = Новый Структура("МестоХраненияКанбанов,МПЗ",Элементы.Канбаны.ТекущиеДанные.МестоХранения,Элементы.Канбаны.ТекущиеДанные.МПЗ);
		Если ОткрытьФормуМодально("ОбщаяФорма.ОформлениеПустыхКанбанов",П) Тогда
		ПолучитьДанныеНаСервере();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОформитьПустойКанбанПоВыбору(Команда)
ОткрытьФормуМодально("ОбщаяФорма.ОформлениеПустыхКанбанов");
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалОбновленияПриИзменении(Элемент)
ОтключитьОбработчикОжидания("ПолучитьДанныеПоПустымКанбанам");
	Если Объект.ИнтервалОбновления > 0 Тогда
	ПодключитьОбработчикОжидания("ПолучитьДанныеПоПустымКанбанам", Объект.ИнтервалОбновления*60);
	КонецЕсли; 
КонецПроцедуры
